метод Операция(А1: Число, оп: Строка, Б1: Число): Число
    выбор оп
      когда "+"
        возврат А1 + Б1
      когда "-"
        возврат А1 - Б1
      когда "/"
        возврат А1 / Б1
      когда "*"
        возврат А1 * Б1
    когда "^"
        возврат А1 ** Б1
      иначе
        возврат 0
    ;
;

метод Вывод(А2: Число, оп2: Строка, Б2: Число): Строка
    пер ответ = Операция(А2, оп2, Б2)
    возврат "$А2 $оп2 $Б2 = $ответ"
;

метод Скрипт()
    пер вывод = Вывод(10, "+", 7)
    Консоль.Записать(вывод)
;