#совместимость 10.0
метод Скрипт()
  пер Д: Дата = Дата{1985-05-31}
  пер ДВ1: ДатаВремя = ДатаВремя{2026-09-01 08:10:55}
  пер ДВ2: ДатаВремя = ДатаВремя.Сейчас()
  Консоль.Записать("${Д|дд.ММ.гггг}")
  Консоль.Записать("%{ДВ2.ДеньНедели()} ${ДВ2|дд.ММ.гггг чч:мм:сс}")
  пер НДВ = Д.НачалоДня() + 14ч
  пер разница = (ДВ2 - ДВ1).Дни
  Консоль.Записать(НДВ.Представление())
  Консоль.Записать(разница.Представление())
  Консоль.Записать("==============")
  пер ДВ3: ДатаВремя = ДатаВремя.Сейчас().КонецДня()
  Консоль.Записать(ДВ3.Представление())
;