метод ПоказатьКарточкуПерсонажа(Имя: Строка, Роль: Строка, Уровень: Число, Здоровье: Число, КлючНайден: Булево)
    Консоль.Записать("Имя: " + Имя)
    Консоль.Записать("Роль: " + Роль)
    Консоль.Записать("Уровень: " + Уровень)
    Консоль.Записать("Здоровье: " + Здоровье)
    Консоль.Записать("Ключ найден: " + КлючНайден)
;

метод ПоказатьКарточкуПерсонажа(Имя: Строка, Роль: Строка, Уровень: Число, Здоровье: Число, КлючНайден: Булево)
    Консоль.Записать("Имя: %Имя")
    Консоль.Записать("Роль: %Роль")
    Консоль.Записать("Уровень: %Уровень")
    Консоль.Записать("Здоровье: %Здоровье")
    Консоль.Записать("Ключ найден: %КлючНайден")
;

метод Скрипт()
    ПоказатьКарточкуПерсонажа("Шерлок Кодс", "детектив", 1, 100, Ложь)
;
