метод Сложи(А: Число, Б: Число): Число
    пер З: Число = А + Б
    возврат З
;

метод Скрипт()
    пер Д1 = ДатаВремя.Сейчас()
    пер Д2 = Дата{2027-02-23}
    Д1 = ДатаВремя{2028-02-29 08:08:08}
    Д1 += 12345д7ч12м
    Д2 += 13д
    Консоль.Записать("${Д1|дд ММММ гггг чч:мм:сс}")
    Консоль.Записать("${Д2|дд ММММ гггг}")
    пер Н = Сложи(5, 8)
    Консоль.Записать(Н)
    Консоль.Записать(Сложи(3, 7))
    Консоль.Записать(Сложи(12, 17))
    пер М = 0
    для И = 1 по 5
        М = И + 1
        Консоль.Записать(М)
    ;
;
